# Programming

### Quastion No. 1

In [5]:
# this functions convert decimal number to binary, octall and hexdecimal.
# the functions divide the decimal number and put the remainder in the array.
# then, each element in the array is multiplied by 10 to the power of the index.
# the function output is their total sum.
def binary(n):
    x=[]
    while (n>=1):
        x.append(n%2)
        n=n//2
    p=0
    y=0
    while y<len(x):
        p+=x[y]*(10**y)
        y=y+1
    return p
   
def octall(n):
    x=[]
    while (n>=1):
        x.append(n%8)
        n=n//8
    p=0
    y=0
    while y<len(x):
        p+=x[y]*(10**y)
        y=y+1
    return p  

def hexadecimal(n):
    x=[]
    while (n>=1):
        x.append(n%16)
        n=n//16
    p=0
    y=0
    while y<len(x):
        p+=x[y]*(10**y)
        y=y+1
    return p

### Quastion No. 2

In [10]:
import numpy as np
import pandas as pd
cast=pd.read_csv(r'C:\Users\נעמיה\OneDrive - Ariel University\Documents\Data sciente\finall project\cast.csv')

In [13]:
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

#### 1.How many movies have the title "Hamlet"?

In [33]:
# sum all values in 'title' that equal to 'Hamlet'
(cast['title']=='Hamlet').sum()

299

#### 2. List all of the "Treasure Island" movies from earliest to most recent.

In [49]:
# select the rows in 'title' that whose values is 'Treasure Island',then sort by 'year'
cast.loc[cast['title']=='Treasure Island'].sort_values(by=['year'])

,title,year,name,type,character,n
1312766,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3280557,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3046750,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1167783,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

#### 3.How many roles were credited in the silent 1921 version of Hamlet?

In [94]:
# from the versions of 'Hamlet' choose the one of 1921 and count how many roles were credited
cast.loc[cast['title']=='Hamlet'].year.value_counts()[1921]

9

#### 4.Use groupby() to plot the number of "Hamlet" films made each decade

In [96]:
cast.groupby((cast.year//10)*10).sum()

            year           n
year
1890        5682         0.0
1900      133505       555.0
1910    80418489    188050.0
1920   134533486    332003.0
1930   379528881    761911.0
1940   402351472    791019.0
1950   396404924   1024159.0
1960   342100006   1144475.0
1970   395095992   1993198.0
1980   535369206   4125527.0
1990   735729461   6054683.0
2000  1468488651  10018647.0
2010  1752803032   7901911.0
2020      117176        37.0